# bot api
API_KEY = ''

# menu messages
OPTION_MESSAGE = '📲 لطفاً گزینه مورد نظر را انتخاب کنید.'
GET_FILE = '📊 دریافت کارنامه دانش آموز'
CLOSE_MENU = 'خروج 👋'


# messages
WELCOME_MESSAGE = 'سلام {first_name} عزیز به ربات آزمون معیار 🎯 مجتمع آموزشی سروش خوش آمدید.'
USERNAME_PROMPT = '🧑‍🎓 لطفاً نام کاربری خود را وارد کنید:'
PASSWORD_PROMPT = '🔐 لطفاً گذرواژه خود را وارد کنید:'
SUCCESSED_LOGIN_MESSAGE = '✅ شما با موفقیت وارد اکانت دانش آموز {first_name} {last_name} شدید. '
THANK_YOU_MESSAGE = 'از همراهی شما سپاس گذاریم 🙏.'
GET_FILE = 'دریافت کارنامه دانش آموز 📊'
SURVEY_MESSAGE = '📨 آزمون معیار رو چگونه ارزیابی می کنید؟ '
SURVEY_DONE = '✅ نظر شما با موفقیت ثبت شد.'
SURVEY_ASK = 'لطفاً نظر خود را از بین گزینه‌های زیر انتخاب کنید:'

# error messages
INVALID_USERNAME = '🚨 کاربری با این نام کاربری وجود ندارد. لطفاً دوباره تلاش کنید. 🚨'
INVALID_PASSWORD = '🚨 گذرواژه اشتباه است. لطفاً دوباره تلاش کنید. 🚨'
MAX_LOGIN_ATTEMPTS_EXCEEDED = '🚨 تعداد تلاش‌های شما برای ورود به سیستم بیش از حد مجاز است. لطفاً بعداً تلاش کنید. 🚨'
FILE_NOT_FOUND_MESSAGE = '🚨 فایلی برای دانلود موجود نیست. 🚨'
NO_RECORD_FOUND_MESSAGE = '🚨 رکوردی برای دانش‌آموز یافت نشد. 🚨'
ERROR_MESSAGE = '🚨 خطایی رخ داده است. 🚨'
OUT_OF_CONDITION = '😵‍💫 متوجه نشدم چه کاری انجام بدم؟! '

# dataBase information
DB_HOST = ''
DB_NAME = ''
DB_USER = ''
DB_PASSWORD = ''
DB_PORT = ''
